package com.hengyuan.hicash.utils;

public enum Rules {
	//进件规则
	RULEA0001("18岁以下"),//	18岁以下
	RULEA0002("大专学历且年龄大于24岁"),//	大专学历且年龄大于24岁
	RULEA0003("身份证命中黑名单"),//	身份证命中黑名单
	RULEA0004("手机号码命中黑名单"),//	手机号码命中黑名单
	RULEA0005("申请学校为黑名单"),//	申请学校为黑名单
	RULEA0006("历史借款存在M2以上"),//	历史借款存在M2以上
	RULEA0007("年龄小于20或者大于35"),//年龄小于20或者大于35
	RULEA0008("学历层次专科以下"),//学历层次专科以下
	RULEA0009("申请人工作与居住所在地均非我司业务开放区域"),//申请人工作与居住所在地均非我司业务开放区域
	RULEA0010("聚信立手机非本人实名"),//聚信立手机非本人实名
	RULEA0011("聚信立申请人号码、身份证未出现在网贷黑名单或法院黑名单内"),//聚信立申请人号码、身份证未出现在网贷黑名单或法院黑名单内
	RULEA0012("18岁以下、30岁以上"),//18岁以下、30岁以上
	RULEA0013("客户当前逾期"),
	RULEA0014("客户历史逾期大于等于M2"),
	RULEA0015("客户历史逾期且产生滞纳金次数大于5次"),
	RULEA0016("亲属无呼叫记录"),
	RULEA0017("手机号入网时间小于6个月"),
	RULEA0018("聚信立报告显示网贷公司数量大于等于5且主叫次数大于等于20次"),
	RULEA0019("身份证归属地为3508、3509"),
	RULEA0020("命中同盾黑名单"),
	RULEA0021("命中秉承黑名单"),
	RULEA0022("大学生评分规则"),
	RULEA0023("个人风险汇总查询规则"),
	RULEA0024("嗨秒贷一月之内被拒客户"),
	RULEA0025("民族必须是汉族"),
	RULEA0026("身份证过期"),
	RULEA0027("身份证有效期不符合要求（5年，10年。。。）"),
	RULEA0028("聚信立报告显示网贷公司数量大于等于6且主叫次数大于等于20次"),
	RULEA0029("年龄不符合规则"),
	RULEA0030("聚信立直系亲属无呼叫记录"),
	RULEA0031("聚信立紧急联系人无呼叫记录"),
	RULEA0032("申请8000元金额的"),

	//预审规则
	RULEB0000("新疆、西藏且民族为藏、维吾尔、哈萨克族男性"),//1	新疆、西藏且民族为藏、维吾尔、哈萨克族男性
	RULEB0001("身份证是否有效"),//	身份证是否有效
	RULEB0002("学生证是否有效"),//	学生证是否有效
	RULEB0003("手机实名是否本人"),//	手机实名是否本人
	RULEB0004("现场照与身份证、学生证对比是否本人"),//	现场照与身份证、学生证对比是否本人
	RULEB0005("现场照拍摄是否符合规范"),//	现场照拍摄是否符合规范
	RULEB0006("协议签字是否规范"),//	协议签字是否规范
	RULEB0007("鹏元征信学籍查询是否有结果"),//	鹏元征信学籍查询是否有结果
	RULEB0008("身份证发证机关与鹏元征信查询户籍地址是否一致"),//	身份证发证机关与鹏元征信查询户籍地址是否一致
	RULEB0009("申请信息是否与鹏元学籍信息一致"),//	请信息是否与鹏元学籍信息一致
	RULEB0010("录取方式是否为统招"),//0	录取方式是否为统招
	RULEB0011("鹏元征信身份认证是否一致"),//鹏元征信身份认证是否一致
	RULEB0012("申请信息及材料完整无异常点"),//申请信息/材料是否存在异常点
	RULEB0013(""),//无用字段
	RULEB0023("网查无负面信息"),//	网查无负面信息
	RULEB0024("授信额度及期数是否符合要求"),//	授信额度及期数是否符合要求
	RULEB0025("工作证明是否有效"),//	工作证明是否有效 
	RULEB0026("收入证明是否有效"),//	收入证明是否有效
	//反欺诈规则
	RULEC0001("身份证号是否对应2个或2个以上的申请人"),//	身份证号是否对应2个或2个以上的申请人
	RULEC0002("手机号是否对应2个或2个以上的申请人"),//	手机号是否对应2个或2个以上的申请人
	RULEC0003("手机号是否对应2个或2个以上的身份证号"),//	手机号是否对应2个或2个以上的身份证号
	RULEC0004("手机号是否对应2个或2个以上的身份证号"),//	直系亲属手机号是否对应2个或2个以上的申请人
	RULEC0005("直系亲属手机号是否对应2个或2个以上的身份证号"),//	直系亲属手机号是否对应2个或2个以上的身份证号
	RULEC0006("紧急联系人手机号是否对应2个或2个以上的申请人"),//	紧急联系人手机号是否对应2个或2个以上的申请人
	RULEC0007("紧急联系人手机号是否对应2个或2个以上的身份证号"),//	紧急联系人手机号是否对应2个或2个以上的身份证号
	RULEC0008("家庭固话是否对应多个身份证号"),//	家庭固话是否对应多个身份证号
	RULEC0009("家庭地址对应2个或2个以上身份证号"),//	家庭地址对应2个或2个以上身份证号
	RULEC0010("单位电话对应2个或2个以上身份证号码"),//	单位电话对应2个或2个以上身份证号码
	RULEC0011("单位电话对应2个或2个以上单位名称"),//	单位电话对应2个或2个以上单位名称
	RULEC0012("单位电话对应2个或2个以上单位地址"),//	单位电话对应2个或2个以上单位地址
	RULEC0013("单位名称对应2个或2个以上单位地址"),//	单位名称对应2个或2个以上单位地址
	//自动通过规则
	RULED0001("申请金额是否是3000以下"),//	申请金额是否是3000以下
	RULED0002("白名单是否存在"),//	白名单是否存在
	RULED0003("申请金额是否是5000以下"),//	申请金额是否是5000以下
	RULED0004("历史借款当前无逾期"),//	历史借款当前无逾期
	RULED0005("申请金额是否是2000以下"),//	申请金额是否是2000以下
	RULED0006("自动规则1(学生)"),//	自动规则1(学生)
	RULED0007("自动规则2(学生)"),//	自动规则2(学生)
	RULED0008("自动规则3(白领)"),//	自动规则3(白领)
	RULED0010("嗨秒贷3000 自动规则1(老客户)"),
	RULED0011("嗨秒贷3000 自动规则2(学生新客户)"),
	RULED0012("嗨秒贷3000 自动规则3(白领新客户)"),
	
	//电核规则
	RULEE0001("是否是本人申请"),//	是否是本人申请
	RULEE0002("期数选择是否满足要求"),//	期数选择是否满足要求
	RULEE0003("鹏元征信是否能查询到信息"),//	鹏元征信是否能查询到信息
	RULEE0004("电核核实是否确认学籍"),//	电核核实是否确认学籍  
	RULEE0005("是否全日制"),//	是否全日制
	RULEE0006("是否本地户籍"),//	是否本地户籍
	RULEE0007("教务网查询是否存在学籍"),//	教务网查询是否存在学籍 
	RULEE0008("贷款金额<=3000"),//	贷款金额<=3000
	RULEE0010("贷款金额<=2000"),//	贷款金额<=2000
	RULEE0013("网查负面信息核实结果是否正常"),//	
	RULEE0014("申请信息、材料异常点是否已排除"),
	RULEE0015("授信额度及期数是否符合要求"),
	RULEE0016("联系人信息核实是否属实"),//联系人信息核实是否属实
	
	
	//终审规则
	RULEF0001("网查是否存在负面信息"),//	网查是否存在负面信息
	RULEF0002("QQ是否存在负面信息"),//	QQ是否存在负面信息
	RULEF0003("历史还款是否符合要求"),//	历史还款是否符合要求
	RULEF0004("法院分析是否符合要求"),//	法院分析是否符合要求
	RULEF0005("电核确认结果"),//	电核确认结果
	RULEF0006("综合评估"),//	综合评估
	
	RULEF0007("网查负面信息核实结果是否正常"),//	
	RULEF0008("申请信息、材料异常点是否已排除"),
	RULEF0009("单位信息核实是否属实"),
	RULEF0010("联系人信息核实是否属实"),//联系人信息核实是否属实
	RULEF0011("是否确认本人申请"),//是否确认本人申请
	//差错规则列表
	RULEF0012("初审员操作是否存在差错"),
	RULEF0013("初审员点选操作是否符合要求"),
	RULEF0014("初审员致电记录添加是否符合要求"),
	RULEF0015("初审员意见填写是否符合要求"),
	RULEF0016("初审员电核结果是否符合要求"),
	
	//免电核规则
	RULEG0001("产品为数码产品，且客户类型为学生"),//	产品为数码产品，且客户类型为学生
	RULEG0002("预审字段为是"),//	预审字段为是
	RULEG0003("贷款金额小于6000"),//	贷款金额小于6000
	RULEG0004("贷款金额小于3000"),//	贷款金额小于3000
	
	//预审规则（白领）
	//RULEB0000 新疆、西藏且民族为藏、维吾尔、哈萨克族男性
	//RULEB0001("身份证是否有效"),//	身份证是否有效
	//RULEB0003("手机实名是否本人"),//	手机实名是否本人
	//RULEB0004("现场照与身份证、学生证对比是否本人"),//	现场照与身份证、学生证对比是否本人
	//RULEB0012("申请信息/材料是否存在异常点"),//申请信息/材料是否存在异常点
	RULEB0014("工作证明是否有效"),//工作证明是否有效
	RULEB0015("收入证明是否有效"),//收入证明是否有效
	RULEB0016("结婚证是否有效"),//结婚证是否有效
	RULEB0017("人行征信报告是否有效"),//人行征信报告是否有效
	RULEB0018("法院网核查是否有被执行记录"),//法院网核查是否有被执行记录
	RULEB0020("聚信立报告验证"),//聚信立报告验证
	RULEB0021("聚信立亲属呼叫无记录"),//聚信立亲属呼叫无记录
	RULEB0022("手机号码入网时间小于半年"),//手机号码入网时间小于半年
	
	//电核规则（白领）
	//RULEE0001	是否是本人申请 
	RULEE0009("单位信息是否确认真实"),//单位信息是否确认真实
	RULEE0011("是否同贷书模式"),//是否同贷书模式
	
	//电核显示规则（嗨秒贷）
	RULEH0001("DH001(学生新客户)"),
	RULEH0002("DH002(白领新客户)"),
	RULEH0003("DH003(老客户)"),
	
	//商户、业务员风险评估
	RULEX0001("统计天数>7，当月FPD%>20%"),
	RULEX0002("统计天数<=7，最近一月FPD%>20%"),
	RULEX0003("最近连续三月FPD%>15%"),
	RULEX0004("当月M1>20%"),
	RULEX0005("最近连续三月M1>15%"),
	RULEX0006("最近连续三月M1>15%"),
	RULEX0007("最近连续三月M2>10%"),
	RULEX0008("最近一月M3>10%"),
	RULEX0009("最近连续三月M3>8%"),
	RULEX0010("最近一月M4+>8%"),
	RULEX0011("最近连续三月M4+>6%"),
	RULEX0012("统计天数>7，当月FPD%>50%"),
	RULEX0013("统计天数<=7，最近一月FPD%>50%"),
	RULEX0014("最近连续三月FPD%>40%"),
	RULEX0015("当月M1>30%"),
	RULEX0016("最近连续三月M1>20%"),
	
	
	
	
	//数据库期初数据
	RULE001("RULE001"),
	RULE002("RULE002"),
	RULE003("RULE003"),
	RULE004("RULE004"),
	RULE005("RULE005"),
	RULE006("RULE006"),
	RULE007("RULE007"),
	RULE008("RULE008"),
	RULE009("RULE009"),
	RULE010("RULE010"),
	RULE011("RULE011"),
	RULE012("RULE012"),

 
	//2016.3.28
	RULEB0027("现场照有效且与身份证对比为本人"),//	现场照有效且与身份证对比为本人
	RULEB0028("代扣银行卡是否符合要求"),//	代扣银行卡是否符合要求
	RULEB0029("现居地址证明是否有效"),//	现居地址证明是否有效
	RULEB0030("办公场景照片是否有效"),//	办公场景照片是否有效
	RULEB0031("征信报告是否有效"),//	征信报告是否有效
	RULEB0032("客户或配偶在法院网存在执行案件"),//	客户或配偶在法院网存在执行案件  
	RULEB0033("房产证明材料是否有效"),//	房产证明材料是否有效  
	RULEB0034("信用卡是否符合要求（非必选项）"),//	信用卡是否符合要求（非必选项）
	RULEB0035("信用卡账单是否有效（非必选项 "),//	信用卡账单是否有效（非必选项
	RULEB0037("同盾评分结果"),//	同盾评分结果
	RULEB0038("第三方征信是否核查"),//	第三方征信是否核查
	RULEB0039("身份认证是否一致"),//	身份认证是否一致
	RULEB0040("手机号码是否本人实名"),//	手机号码是否本人实名
	RULEB0041("网查是否存在负面信息"),//	网查是否存在负面信息
	RULEB0042("民族必须是汉族");



	

	
	
	private String dispValue;
	
	Rules(String dispValue) {
		this.dispValue = dispValue;
	}
	
	public String getDispValue() {
		return dispValue;
	}
	
}
